# SetCutBackgroundPatternColor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetCutBackgroundPatternColor Method
OverrideGraphicSettings Class See Also
---
Sets the override color of the background pattern of cut faces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public OverrideGraphicSettings SetCutBackgroundPatternColor(
	Color color
)
```

Visual Basic
---
```text
Public Function SetCutBackgroundPatternColor ( _
	color As Color _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetCutBackgroundPatternColor(
	Color^ color
)
```

# ### Parameters
color
    Type: Autodesk.Revit.DB..::..Color Value of the cut face background color for the override. InvalidColorValue means no override is set.
# ### Return Value
Reference to the changed object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace